// 3. Найти максимальное из трех чисел.
Console.WriteLine("Введите трех значное число");
int a = int.Parse(Console.ReadLine()!);
int b = a % 100;
Console.WriteLine(b);

